same_words = "под пор правда похуй своих чего если руки равно меня чем никогда спасибо время всю может типа уже ведь сказать первый себя вот всегда все слишком его могу тогда никто поэтому нас жопу нахуя нахуй быдло которые когда короче много норм лет хотя быть можешь хочешь сделать всё хуй перед который кто-то другой работы видел видео которых хоть сука сколько один кун иди чтоб без ней свой свои свою каждый часто пару бля мне давно понимаю сша конечно деньги год есть куда вроде либо весь https человека люди тем помню потом эта себе вообще месяц своей нихуя нет нормально потому этом этой только как этот мало тут бамп знаю понял где будет нужно дома нужны просто работает вопрос чтобы таки пока делать youtube друг что тян сейчас такую кроме дохуя этих этим ему http как-то реально людей того было были была года раз думал мамка думаю такие таких нужен из-за надо пиздец двачую более сами будешь два такое такой алсо после могут она они лишь или хотел которая буду такая теперь дела дело зачем именно около ещё хорошо дальше значит очень работать тред постоянно кто говорить почему больше него кстати тебя ибо тебе детей тоже знает даже блядь еще жить нам для анон совсем мой моя watch всех назад всем какие опять день хочу вас блять вам несколько всего будут одной лол какой этого был нравится хуйня хуйню ничего сам денег том человек так там стоит твой эту это эти почти при ним них через про самое можно сегодня говорят здесь выше например лучше жизнь жизни немного ебать говно что-то сразу тот the amp дом -настоящий  любой мимо вокруг разве video mkv out времени мол месте какой-то году мира дней стран страны второй мог твоей очевидно домой всякие сих сделал часть прав рядом возможно иначе также and между нельзя иногда других сказал купить своего обычно хочет должны прямо откуда раньше давай сидит вместе знаешь живут взять должен суть другие хуже ладно наверное является работе заебись раза кажется сильно деле той особенно скорее взял большой будто две против зато живу скоро говорит вполне долго стороны вместо стал"
    .split(" ");

bio_words = [
    'тян', 'тяна', 'тяны', 'тянов', 'тянами', 'тня', 'тни', 'тне', 'тню', 'тней', 'тнями', 'тням', 'тнях', 
    'тянка', 'тянку', 'тянке', 'тянкой', 'тянки', 'тянок', 'тянкам', 'тянках', 'тяночка','тяночкой', 'тяночки', 'страшнотян', 'среднетян', 'обычнотян',
    'еот', 'отношения', 'отношений', 'отношениям', 'отношениями', 'отношениях', 'любовь', 'любви', 'любовью',
    'пиздострадания', 'пиздостраданиям', 'поебушки', 'поебушек', 'трахаться','потрахаться', 'потрахались', 'трахнул', 
    'секс', 'секса', 'сексом', 'сексуальные', 'сексе', 'сексуальный', 'девственник', 'девственника', 'девственница', 'девственницу',
    'девственность', 'девственности', 'лиственник', 'лиственница', 'писечка', 'писечку',
    'фимоз', 'фимозник', 'скорострел', 'девушка', 'девушки', 'самки', 'самка', 'самку', 'самкой', 'пиздострадаю', 'пиздострадал', 'пиздострадать'
];

nya_words = "няша няшу няшиться няше няшимся няшенье стесняшу поняшить няшкаться няшкаемся няшка ня няшной няшная няшками няшным няши няшную няшей няшка"
    .split(" ");

huy_words = "хуй нахуй похуй нихуя хуйня дохуя хуйню нахуя охуенно хуя хуйни нехуй хуи охуел охуенный хуем охуеешь хуйло хуево охуеть ахуенно хуев хуйне хуесос хую схуяли хуёво оп-хуй охуительные хуевая хуита хуиту охуенного охуеваю хуям хуепутало охуеете хуйца хуета хуету охуенные охуевших охуевшая нихуево хуесосит хуец ахуеть похую хуе хуеву хуячить охуенности охуительная хуйней охуели хуесосили хуями охуенен овердохуя хуйнёй хуевей охуенным хуйцом нихуевые нихуянеделание хуила охуительно захуячили хуею хули хуле охуевал хуюси хуярить хуевой хуяришь хуитку хуячит хуевом ахуели охуенная охуевают охуевать охуенное"
    .split(" ");

pizda_words = "пиздец пизды пизда пиздуй пизду пиздатый пиздят пиздишь пиздеть пиздабол пиздит попиздеть пизде спиздил пиздюлей отпиздить распиздяи пизди пиздюки пиздуйте опиздюлил спиздили пиздатые пиздует пиздатую пиздаче пиздых пиздила пиздецки спиздят впизду распиздяйства пиздящий пиздобол пиздато пиздили пиздить отпиздит пиздой спизди пиздеца отпиздят пиздеж отпиздили распиздяйство пиздёжь пиздюк пиздоглазой спиздить пиздюка пиздюком пиздил пиздел пиздим пиздуешь пиздатом распиздатые пиздюку напиздел"
    .split(" ");

polit_words = "крым крымотред крымотреды крымотреду крыму путин путину рашке рашку рашка рашки пидораха пидорахой пидорашек пидораший пидорашки ватники ватник ватные либерашка либеральных либерализма либерализм либерашки либералы сша сшп нато  украине украину украина украинских украины украинская хохляндия хохляндии хохол хохлы хохлов хохла майдан майдана майдане майдауны политика политики политической политических политического политику политикой политические политический политическое политиков политически политическими политике политик политологи российских россию россией россии российской российском россиюшка россиян россияне российский российская российские  американские американской американского американских американцы америку америки американский американском американскую американцам американское намерениях америке"
    .split(" ");

student_words = "универ университет отчислен отчислят отчислили отчисляют препод завалил армии армию армия армией откосить косил откосил эгэ гиа одногруппник одногрупница одногрупники одногруппников вуз вузе вуза вузов школы школу школе школьник школьных школ школьников школа школах школьники"
    .split(" ");

bydlo_words = "быдло быдла быдлом быдлу быдланов быдлан быдланы небыдло"
    .split(" ");

roll_words = "ролл реролл roll reroll дабл даблы дабле трипл триплы трипле квадрипл"
    .split(" ");

sage_words = "сажа сажи сажу сега sage"
    .split(" ");

trash_words = "не на что ты это как все по но так за то же меня если мне ну да вот нет из только бы или уже тебя есть от просто для еще там тебе даже они он будет можно она его когда было вообще раз их чем тут лет надо всё потом до может без тоже кто сам где чтобы потому теперь этого почему ещё про лучше один быть был сейчас ее больше вы при ничего себе такой под очень ни делать нужно мы через со того после тогда нас них которые себя могу во года этом этот пока ней чего ли иди зачем всем такие ведь хотя знаю что-то таких youtube всех никто который хочу знает том watch http её им всегда будешь такое какой ему всего вроде будут никогда была конечно хоть сразу такая сколько каждый значит много пару эти кстати него либо ей свои моя свою какие свой вас совсем ru куда именно мой можешь равно тем этой буду всю были более стоит весь ибо вам почти из-за своей этим эта уж эту одного твой самое https кого нам об тех перед такого здесь одна пусть тот опять самом твоя ним лишь немного кто-то моей чтоб случае назад которым такую этих ними разу тобой этому своих твои около пор вся как-то та нее снова часто сами самый тому выше своим которой кому над собой мои всей таким туда какая мной неё оно свое en wiki wikipedia org youtube"
    .split(" ");

function countIndexes(key, value) {
    if ($.inArray(key, bio_words) != -1) { indexes["bio"] += value; }
    else if ($.inArray(key, nya_words) != -1) {indexes["nya"] += value;}
    else if ($.inArray(key, huy_words) != -1) {indexes["huy"] += value;}
    else if ($.inArray(key, pizda_words) != -1) {indexes["pizda"] += value;}
    else if ($.inArray(key, polit_words) != -1) {indexes["polit"] += value;}
    else if ($.inArray(key, student_words) != -1) {indexes["student"] += value;}
    else if ($.inArray(key, bydlo_words) != -1) {indexes["bydlo"] += value;}
    else if ($.inArray(key, roll_words) != -1) {indexes["roll"] += value;}
    else if ($.inArray(key, sage_words) != -1) {indexes["sage"] += value;}
}

function filterTrash(temp) {
    splice_keys = [];
    $.each(temp, function(key, value){
        if (value.k.length < 2) { delete temp[key]; }
        else if ($.inArray(value.k, trash_words) != -1) { delete temp[key]; }
    });
}

function getTrends(temp) {
    trends = [];
    
    $.each(temp, function(key, value){
        if (trends.length > 19) {
            return 0;
        }
        if (value) {
            if (value.v > 19 && value.k.length > 2) { 
                if ($.inArray(value.k, same_words) == -1) trends.push(value);
            }
        }
    });
}

indexes = [];
indexes['bio'] = 0; indexes['nya'] = 0; indexes['huy'] = 0; indexes['pizda'] = 0;
indexes['polit'] = 0; indexes['student'] = 0; indexes['bydlo'] = 0; indexes['roll'] = 0;
indexes['sage'] = 0;


function abbr(mode) {
    if (mode == "bio") { return "Со словами в /b/: тян, еот и так далее."; }
    else if (mode == "nya") { return "ня :3"; }
    else if (mode == "huy") { return "Производные от слова хуй."; }
    else if (mode == "pizda") { return "Производные от слова пизда."; }
    else if (mode == "polit") { return "ПУТИН СЪЕЛ УКРАИНСКОГО МЛАДЕНЦА!"; }
    else if (mode == "bydlo") { return "Быдло ехало через быдло."; }
    else return "";
}
